#pragma once
#include <iostream>

using namespace std;
/*Створіть клас Book. Необхідно зберігати дані: автор, назва, видавництво, рік, кількість, сторінок.
Створити масив об’єктів. Вивести: 
■ список книг заданого автора;
■ список книг, випущених заданим видавництвом; 
■ список книг, випущених після заданого року. 
Використовуйте константні функції-члени (наприклад, для відображення даних про книгу ).
*/
class Book
{
private:
	char* nameAuthor;
	char* nameBook;
	char* publishing;
	char* date;
	int amount;
	int pages;
public:
	Book();
	~Book();
};

